// my vaforite verse

#include <iostream>

using namespace std;

int main(int argc, char *argv[]) 
{
    cout << "Меня учили в школе закону, мое не твое." << endl
    << "Когда я уже научился, я понял что это не все." << endl
    << "У одних был вкусный завтрак, други кусали кулак." << endl
    << "Вот так я в первые усвоил понятие, классвый враг!" << endl
    << "Я понял как и откуда протеворечия взялись." << endl
    << "Так будет всегда, покуда дождь падает сверху вниз!" << endl 
    << endl
    << "Твердили мне, будешь послушным, странешь таким как они." << endl
    << "Я же понял, не стать тому мясником, кто ягненком был из кони!" << endl
    << "Иной стремился к богатству, и втирался к богатым он." << endl
    << "Я видел как искрине он удивлялся когда его гнали вон." << endl
    << "А я не хотел девиться, я знал уже в те года," << endl 
    << "дождь, может лишь к низу литься и вверх не идет никогда." << endl;
    //TODO: Дописать потом
}
